# SQL - Implémentation d'une base de données relationnelle

##  Concevoir une Base De Données sans méthode : Partie 2

### 3.1. Mise en situation

In [ ]:
    #dbName = "discotheque"      # nom de la base de données
    user = "postgres"              # propriétaire ou utilisateur
    passwd = "admin"            # mot de passe d'accès
    host = "127.0.0.1"          # nom ou adresse IP du serveur
    port =5432

```sh
# psql -h localhost -U adm dst_db

psql -h localhost -U postgres admin

cd && wget https://dst-de.s3.eu-west-3.amazonaws.com/bdd_postgres_fr/database/chenil_v1.sql
wget https://dst-de.s3.eu-west-3.amazonaws.com/bdd_postgres_fr/database/chenil_v2.sql
wget https://dst-de.s3.eu-west-3.amazonaws.com/bdd_postgres_fr/database/chenil_v3.sql
wget https://dst-de.s3.eu-west-3.amazonaws.com/bdd_postgres_fr/database/chenil_v4.sql



"C:\Users\awounfouet\python-database\chenil_v1.sql"


# Restauration de la base chenil_v1
docker exec -i pg_container psql -U daniel -d chenil_v1 < ./chenil_v1.sql
docker exec -i pg_container psql -U daniel -d chenil_v2 < ./chenil_v2.sql
docker exec -i pg_container psql -U daniel -d chenil_v3 < ./chenil_v3.sql
docker exec -i pg_container psql -U daniel -d chenil_v4 < ./chenil_v4.sql


psql -h localhost -U postgres admin -d chenil_v4 < ./chenil_v4.sql
```

In [114]:
# !wget https://dst-de.s3.eu-west-3.amazonaws.com/bdd_postgres_fr/database/chenil_v1.sql


# Restauration des base données

```sh
docker exec -i pg_container psql -U daniel -d chenil_v1 < ./chenil_v1.sql
docker exec -i pg_container psql -U daniel -d chenil_v2 < ./chenil_v2.sql
docker exec -i pg_container psql -U daniel -d chenil_v3 < ./chenil_v3.sql
docker exec -i pg_container psql -U daniel -d chenil_v4 < ./chenil_v4.sql
```

Cette commande permet d'entrer à postgresql le contenu du fichier spécifié à droite de la commande. Ce fichier est une sauvegarde, l'ensemble des commandes SQL permettant :

De reconstruire la structure de la base
D'insérer toutes les éventuelles données
Vérification


Retournez au premier shell et connectez vous à PostgreSQL (si vous ne l'êtes pas déjà) et placez vous dans une base (chenil_v1 pour commencer):
```sh
# psql -h localhost -U daniel -d chenil_v1
psql -h localhost -U admin -d chenil_v1
```

- La commande est `psql`, il s’agit d’un utilitaire client du serveur PostgreSQL.
- L’option `-U` permet de définir le nom du compte de connexion,
- l’option « `-d` » permet de définir la base de données dans laquelle nous voulons se positionner (ici la base chenil_v1).

In [1]:
class GestionBD:
    "Mise en place et interfaçage d'une base de données PostgreSQL"

    def __init__(self, dbName, user, passwd, host, port=5432):
        "Établissement de la connexion - Création du curseur"
        try:
            # Connexion à la base de données PostgreSQL
            self.baseDonn = connect(
                dbname=dbName,
                user=user,
                password=passwd,
                host=host,
                port=port
            )
        except Exception as err:
            print('La connexion avec la base de données a échoué :\n'
                  f'Erreur détectée :\n{err}')
            self.echec = 1
        else:
            self.cursor = self.baseDonn.cursor()  # Création du curseur
            self.echec = 0

    def __del__(self):
        "Fermeture propre de la connexion à la base de données"
        try:
            if hasattr(self, 'cursor'):
                self.cursor.close()
            if hasattr(self, 'baseDonn'):
                self.baseDonn.close()
        except Exception as err:
            print(f'Erreur lors de la fermeture de la connexion : {err}')


    def creerTables(self, dicTables):
        "Création des tables décrites dans le dictionnaire <dicTables>."
        for table in dicTables:            # parcours des clés du dictionn.
            req = "CREATE TABLE %s (" % table
            pk =''
            for descr in dicTables[table]:
                nomChamp = descr[0]        # libellé du champ à créer
                tch = descr[1]             # type de champ à créer
                if tch =='i':
                    typeChamp ='INTEGER'
                elif tch =='k':
                    # champ 'clé primaire' (entier incrémenté automatiquement)
                    typeChamp ='SERIAL'
                    pk = nomChamp
                else:
                    typeChamp ='VARCHAR(%s)' % tch
                req = req + "%s %s, " % (nomChamp, typeChamp)
            if pk == '':
                req = req[:-2] + ")"
            else:
                req = req + "CONSTRAINT %s_pk PRIMARY KEY(%s))" % (pk, pk)
            self.executerReq(req)

    def supprimerTables(self, dicTables):
        "Suppression de toutes les tables décrites dans <dicTables>"
        for table in list(dicTables.keys()):
            req ="DROP TABLE %s" % table
            self.executerReq(req)
        self.commit()                       # transfert -> disque
        
        
    def executerReq(self, req, param =None):
        "Exécution de la requête <req>, avec détection d'erreur éventuelle"
        try:
            self.cursor.execute(req, param)
        except Exception as err:
            # afficher la requête et le message d'erreur système :
            print("Requête SQL incorrecte :\n{}\nErreur détectée :".format(req))
            print(err)
            return 0
        else:
            return 1

    def resultatReq(self):
        "renvoie le résultat de la requête précédente (une liste de tuples)"
        return self.cursor.fetchall()

    def commit(self):
        if self.baseDonn:
            self.baseDonn.commit()         # transfert curseur -> disque

    def close(self):
        if self.baseDonn:
            self.baseDonn.close()

In [4]:
#!pip install sqlalchemy

In [11]:
from typing import Any, Dict, List, Optional, Tuple
from sqlalchemy import create_engine, text
from sqlalchemy.exc import SQLAlchemyError
from sqlalchemy.engine import Engine, Connection
import logging


class GestionBD:
    """Database management and interfacing for any SQL-based database."""

    def __init__(self, db_url: str):
        """
        Establish a connection to the database and create an engine.
        
        Args:
            db_url (str): Database connection URL (e.g., 'postgresql://user:pass@host:port/dbname')
        """
        self.db_url = db_url
        self.engine: Optional[Engine] = None
        self.connection: Optional[Connection] = None
        self.logger = logging.getLogger("GestionBD")
        logging.basicConfig(level=logging.INFO)

        try:
            self.engine = create_engine(self.db_url)
            self.connection = self.engine.connect()
            self.logger.info("Connected to the database successfully.")
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to connect to the database: {err}")
            raise

    def __del__(self):
        """Ensure proper cleanup of database resources."""
        self.close()

    def list_tables_v1(self) -> List[str]:
        """
        Retrieve a list of all table names in the database.

        Returns:
            List[str]: A list of table names.
        """
        try:
            query = """
            SELECT table_name 
            FROM information_schema.tables 
            WHERE table_schema = 'public'
            """
            result = self.connection.execute(text(query))
            tables = [row['table_name'] for row in result]
            self.logger.info("Retrieved table list successfully.")
            return tables
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to retrieve table list: {err}")
            raise


    def list_tables(self):
        """
        Retrieve a list of all table names in the database.

        Returns:
            List[str]: A list of table names.
        """
        if not self.connection:
            self.logger.error("No database connection.")
            return []

        query = """
        SELECT table_name 
        FROM information_schema.tables 
        WHERE table_schema = 'public'
        """
        try:
            result = self.connection.execute(text(query))
            tables = [row[0] for row in result]  # Access by index since rows are tuples
            self.logger.info("Retrieved table list successfully.")
            return tables
        except Exception as err:
            self.logger.error(f"Error retrieving table list: {err}")
            return []

    def execute_query(self, query: str, params: Optional[Dict[str, Any]] = None) -> Optional[List[Tuple]]:
        """
        Execute a SQL query with optional parameters.

        Args:
            query (str): The SQL query to execute.
            params (Optional[Dict[str, Any]]): Parameters for the query.

        Returns:
            Optional[List[Tuple]]: Query result if applicable.
        """
        try:
            result = self.connection.execute(text(query), params or {})
            if result.returns_rows:
                return result.fetchall()
            return None
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to execute query: {query}\nError: {err}")
            raise

    def create_tables(self, tables: Dict[str, List[Tuple[str, str]]]) -> None:
        """
        Create tables based on the given schema.

        Args:
            tables (Dict[str, List[Tuple[str, str]]]): Dictionary describing the tables and their fields.
                Format: {"table_name": [("field_name", "field_type")]}
        """
        for table, fields in tables.items():
            field_definitions = []
            for field_name, field_type in fields:
                field_definitions.append(f"{field_name} {field_type}")
            field_definitions_str = ", ".join(field_definitions)
            query = f"CREATE TABLE IF NOT EXISTS {table} ({field_definitions_str})"
            self.execute_query(query)
            self.logger.info(f"Table '{table}' created successfully.")

    def drop_tables(self, tables: List[str]) -> None:
        """
        Drop specified tables.

        Args:
            tables (List[str]): List of table names to drop.
        """
        for table in tables:
            query = f"DROP TABLE IF EXISTS {table}"
            self.execute_query(query)
            self.logger.info(f"Table '{table}' dropped successfully.")

    def commit(self) -> None:
        """Commit the current transaction."""
        if self.connection:
            self.connection.commit()

    def close(self) -> None:
        """Close the database connection and engine."""
        if self.connection:
            self.connection.close()
            self.logger.info("Database connection closed.")
        if self.engine:
            self.engine.dispose()
            self.logger.info("Database engine disposed.")

In [8]:
#!pip install psycopg2-binary

In [12]:
#db_url = "postgresql://user:password@localhost:5432/mydb"

#db_url ="postgresql://geoshop_db_owner:JRdKeBf48tmu@ep-old-boat-a2gt5jte.eu-central-1.aws.neon.tech/dst_db?sslmode=require"
db_url ="postgresql://geoshop_db_owner:JRdKeBf48tmu@ep-old-boat-a2gt5jte.eu-central-1.aws.neon.tech/geoshop_db?sslmode=require"
db_manager = GestionBD(db_url)

# List all tables
tables = db_manager.list_tables()
print("Tables in the database:", tables)

# Close connection
db_manager.close()

INFO:GestionBD:Connected to the database successfully.
INFO:GestionBD:Retrieved table list successfully.
INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.

Tables in the database: ['geography_columns', 'geometry_columns', 'spatial_ref_sys', 'django_migrations', 'django_content_type', 'auth_permission', 'auth_group', 'auth_group_permissions', 'auth_user_groups', 'auth_user_user_permissions', 'django_admin_log', 'auth_user', 'django_session', 'shops_shop', 'students_student', 'employees_employee', 'blog_blog', 'blog_comment', 'snippets_snippet']

In [15]:
db_manager = GestionBD(db_url)

# Execute a query
result = db_manager.execute_query("SELECT * FROM students_student")
result
# Close connection
#db_manager.close()

INFO:GestionBD:Connected to the database successfully.
INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.

[(2, '002', 'Keria AWOUNFOUET', 'Communication & Marketing'),
 (1, '001', 'Thomas AWOUNFOUET', 'Software Developper'),
 (3, '003', 'Junior AWOUNFOUET', 'DevOps Engineer'),
 (4, '004', 'Willie AWOUNFOUET', 'Chef de Projet')]

In [17]:
from typing import Any, Dict, List, Optional, Tuple
from sqlalchemy import create_engine, text
from sqlalchemy.exc import SQLAlchemyError
from sqlalchemy.engine import Engine, Connection
import pandas as pd
import logging


class GestionBD:
    """Database management and interfacing for any SQL-based database."""

    def __init__(self, db_url: str):
        """
        Establish a connection to the database and create an engine.
        
        Args:
            db_url (str): Database connection URL (e.g., 'postgresql://user:pass@host:port/dbname')
        """
        self.db_url = db_url
        self.engine: Optional[Engine] = None
        self.connection: Optional[Connection] = None
        self.logger = logging.getLogger("GestionBD")
        logging.basicConfig(level=logging.INFO)

        try:
            self.engine = create_engine(self.db_url)
            self.connection = self.engine.connect()
            self.logger.info("Connected to the database successfully.")
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to connect to the database: {err}")
            raise

    def __del__(self):
        """Ensure proper cleanup of database resources."""
        self.close()

    def execute_query(self, query: str, params: Optional[Dict[str, Any]] = None) -> Optional[List[Tuple]]:
        """
        Execute a SQL query with optional parameters.

        Args:
            query (str): The SQL query to execute.
            params (Optional[Dict[str, Any]]): Parameters for the query.

        Returns:
            Optional[List[Tuple]]: Query result if applicable.
        """
        try:
            result = self.connection.execute(text(query), params or {})
            if result.returns_rows:
                return result.fetchall()
            return None
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to execute query: {query}\nError: {err}")
            raise

    def execute_query_as_df(self, query: str, params: Optional[Dict[str, Any]] = None) -> Optional[pd.DataFrame]:
        """
        Execute a SQL query and return the results as a Pandas DataFrame.

        Args:
            query (str): The SQL query to execute.
            params (Optional[Dict[str, Any]]): Parameters for the query.

        Returns:
            Optional[pd.DataFrame]: DataFrame containing the query results, or None if no rows were returned.
        """
        try:
            result = self.connection.execute(text(query), params or {})
            if result.returns_rows:
                df = pd.DataFrame(result.fetchall(), columns=result.keys())
                return df
            return None
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to execute query as DataFrame: {query}\nError: {err}")
            raise

    def list_tables(self) -> List[str]:
        """
        Retrieve a list of all table names in the database.

        Returns:
            List[str]: A list of table names.
        """
        query = """
        SELECT table_name 
        FROM information_schema.tables 
        WHERE table_schema = 'public'
        """
        try:
            result = self.connection.execute(text(query))
            tables = [row[0] for row in result]
            self.logger.info("Retrieved table list successfully.")
            return tables
        except SQLAlchemyError as err:
            self.logger.error(f"Error retrieving table list: {err}")
            return []

    def close(self) -> None:
        """Close the database connection and engine."""
        if self.connection:
            self.connection.close()
            self.logger.info("Database connection closed.")
        if self.engine:
            self.engine.dispose()
            self.logger.info("Database engine disposed.")

In [ ]:
# Initialize the class
gestion_bd = GestionBD("postgresql://user:password@localhost:5432/mydatabase")

# Execute query and get results as DataFrame
query = "SELECT * FROM employees WHERE department_id = :dept_id"
params = {"dept_id": 101}
df = gestion_bd.execute_query_as_dataframe(query, params)

if df is not None:
    print(df)
else:
    print("No rows returned.")

In [20]:
db_url ="postgresql://geoshop_db_owner:JRdKeBf48tmu@ep-old-boat-a2gt5jte.eu-central-1.aws.neon.tech/geoshop_db?sslmode=require"
db_manager = GestionBD(db_url)

# Execute a query
result = db_manager.execute_query_as_df("SELECT * FROM students_student")
result
# Close

INFO:GestionBD:Connected to the database successfully.

   id student_id               name                     branch
0   2        002   Keria AWOUNFOUET  Communication & Marketing
1   1        001  Thomas AWOUNFOUET        Software Developper
2   3        003  Junior AWOUNFOUET            DevOps Engineer
3   4        004  Willie AWOUNFOUET             Chef de Projet

In [21]:
from typing import Any, Dict, List, Optional, Tuple
from sqlalchemy import create_engine, text
from sqlalchemy.exc import SQLAlchemyError
from sqlalchemy.engine import Engine, Connection
import logging


class GestionBD:
    """Database management and interfacing for any SQL-based database."""

    def __init__(self, db_url: str):
        """
        Establish a connection to the database and create an engine.
        
        Args:
            db_url (str): Database connection URL (e.g., 'postgresql://user:pass@host:port/dbname')
        """
        self.db_url = db_url
        self.engine: Optional[Engine] = None
        self.connection: Optional[Connection] = None
        self.logger = logging.getLogger("GestionBD")
        logging.basicConfig(level=logging.INFO)

        try:
            self.engine = create_engine(self.db_url)
            self.connection = self.engine.connect()
            self.logger.info("Connected to the database successfully.")
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to connect to the database: {err}")
            raise

    def __del__(self):
        """Ensure proper cleanup of database resources."""
        self.close()


    def execute_query_as_df(self, query: str, params: Optional[Dict[str, Any]] = None) -> Optional[pd.DataFrame]:
        """
        Execute a SQL query and return the results as a Pandas DataFrame.

        Args:
            query (str): The SQL query to execute.
            params (Optional[Dict[str, Any]]): Parameters for the query.

        Returns:
            Optional[pd.DataFrame]: DataFrame containing the query results, or None if no rows were returned.
        """
        try:
            result = self.connection.execute(text(query), params or {})
            if result.returns_rows:
                df = pd.DataFrame(result.fetchall(), columns=result.keys())
                return df
            return None
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to execute query as DataFrame: {query}\nError: {err}")
            raise

    def list_tables(self):
        """
        Retrieve a list of all table names in the database.

        Returns:
            List[str]: A list of table names.
        """
        if not self.connection:
            self.logger.error("No database connection.")
            return []

        query = """
        SELECT table_name 
        FROM information_schema.tables 
        WHERE table_schema = 'public'
        """
        try:
            result = self.connection.execute(text(query))
            tables = [row[0] for row in result]  # Access by index since rows are tuples
            self.logger.info("Retrieved table list successfully.")
            return tables
        except Exception as err:
            self.logger.error(f"Error retrieving table list: {err}")
            return []

    def execute_query(self, query: str, params: Optional[Dict[str, Any]] = None) -> Optional[List[Tuple]]:
        """
        Execute a SQL query with optional parameters.

        Args:
            query (str): The SQL query to execute.
            params (Optional[Dict[str, Any]]): Parameters for the query.

        Returns:
            Optional[List[Tuple]]: Query result if applicable.
        """
        try:
            result = self.connection.execute(text(query), params or {})
            if result.returns_rows:
                return result.fetchall()
            return None
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to execute query: {query}\nError: {err}")
            raise

    def create_tables(self, tables: Dict[str, List[Tuple[str, str]]]) -> None:
        """
        Create tables based on the given schema.

        Args:
            tables (Dict[str, List[Tuple[str, str]]]): Dictionary describing the tables and their fields.
                Format: {"table_name": [("field_name", "field_type")]}
        """
        for table, fields in tables.items():
            field_definitions = []
            for field_name, field_type in fields:
                field_definitions.append(f"{field_name} {field_type}")
            field_definitions_str = ", ".join(field_definitions)
            query = f"CREATE TABLE IF NOT EXISTS {table} ({field_definitions_str})"
            self.execute_query(query)
            self.logger.info(f"Table '{table}' created successfully.")
            
    def drop_tables(self, tables: List[str]) -> None:
        """
        Drop specified tables.

        Args:
            tables (List[str]): List of table names to drop.
        """
        for table in tables:
            query = f"DROP TABLE IF EXISTS {table}"
            self.execute_query(query)
            self.logger.info(f"Table '{table}' dropped successfully.")

    def commit(self) -> None:
        """Commit the current transaction."""
        if self.connection:
            self.connection.commit()


    def close(self) -> None:
        """Close the database connection and engine."""
        if self.connection:
            self.connection.close()
            self.logger.info("Database connection closed.")
        if self.engine:
            self.engine.dispose()
            self.logger.info("Database engine disposed.")

In [25]:
# Close connection
#db_manager.close()

In [24]:
db_url ="postgresql://geoshop_db_owner:JRdKeBf48tmu@ep-old-boat-a2gt5jte.eu-central-1.aws.neon.tech/geoshop_db?sslmode=require"
db_manager = GestionBD(db_url)

# Execute a query
result = db_manager.execute_query_as_df("SELECT * FROM students_student")
result
# Close

INFO:GestionBD:Connected to the database successfully.

   id student_id               name                     branch
0   2        002   Keria AWOUNFOUET  Communication & Marketing
1   1        001  Thomas AWOUNFOUET        Software Developper
2   3        003  Junior AWOUNFOUET            DevOps Engineer
3   4        004  Willie AWOUNFOUET             Chef de Projet

In [3]:
from typing import Any, Dict, List, Optional, Tuple
from sqlalchemy import create_engine, text
from sqlalchemy.exc import SQLAlchemyError
from sqlalchemy.engine import Engine, Connection
from sqlalchemy.pool import QueuePool
import pandas as pd
import logging


class GestionBD:
    """Database management and interfacing for any SQL-based database."""

    def __init__(self, db_url: str):
        """
        Establish a connection to the database and create an engine.
        
        Args:
            db_url (str): Database connection URL (e.g., 'postgresql://user:pass@host:port/dbname')
        """
        self.db_url = db_url
        self.engine: Optional[Engine] = None
        self.connection: Optional[Connection] = None
        self.logger = logging.getLogger("GestionBD")
        logging.basicConfig(level=logging.INFO)

        try:
            self.engine = create_engine(
                self.db_url,
                poolclass=QueuePool,  # Use connection pooling
                pool_size=10,
                max_overflow=5,
                pool_timeout=30,
                pool_recycle=1800,  # Recycle connections every 30 minutes
                connect_args={"sslmode": "require", "connect_timeout": 20},
            )
            self.connection = self.engine.connect()
            self.logger.info("Connected to the database successfully.")
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to connect to the database: {err}")
            raise

    def __del__(self):
        """Ensure proper cleanup of database resources."""
        self.close()

    def ensure_connection(self):
        """Ensure the database connection is alive."""
        try:
            if self.connection is None or self.connection.closed:
                self.connection = self.engine.connect()
                self.logger.info("Reconnected to the database.")
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to reconnect to the database: {err}")
            raise

    def execute_query_as_df(self, query: str, params: Optional[Dict[str, Any]] = None) -> Optional[pd.DataFrame]:
        """
        Execute a SQL query and return the results as a Pandas DataFrame.

        Args:
            query (str): The SQL query to execute.
            params (Optional[Dict[str, Any]]): Parameters for the query.

        Returns:
            Optional[pd.DataFrame]: DataFrame containing the query results, or None if no rows were returned.
        """
        try:
            self.ensure_connection()
            result = self.connection.execute(text(query), params or {})
            if result.returns_rows:
                df = pd.DataFrame(result.fetchall(), columns=result.keys())
                return df
            return None
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to execute query as DataFrame: {query}\nError: {err}")
            raise

    def list_tables(self) -> List[str]:
        """
        Retrieve a list of all table names in the database.

        Returns:
            List[str]: A list of table names.
        """
        query = """
        SELECT table_name 
        FROM information_schema.tables 
        WHERE table_schema = 'public'
        """
        try:
            self.ensure_connection()
            result = self.connection.execute(text(query))
            tables = [row[0] for row in result]
            self.logger.info("Retrieved table list successfully.")
            return tables
        except SQLAlchemyError as err:
            self.logger.error(f"Error retrieving table list: {err}")
            return []

    def execute_query(self, query: str, params: Optional[Dict[str, Any]] = None) -> Optional[List[Tuple]]:
        """
        Execute a SQL query with optional parameters.

        Args:
            query (str): The SQL query to execute.
            params (Optional[Dict[str, Any]]): Parameters for the query.

        Returns:
            Optional[List[Tuple]]: Query result if applicable.
        """
        try:
            self.ensure_connection()
            result = self.connection.execute(text(query), params or {})
            if result.returns_rows:
                return result.fetchall()
            return None
        except SQLAlchemyError as err:
            self.logger.error(f"Failed to execute query: {query}\nError: {err}")
            raise

    def create_tables(self, tables: Dict[str, List[Tuple[str, str]]]) -> None:
        """
        Create tables based on the given schema.

        Args:
            tables (Dict[str, List[Tuple[str, str]]]): Dictionary describing the tables and their fields.
                Format: {"table_name": [("field_name", "field_type")]}
        """
        for table, fields in tables.items():
            field_definitions = ", ".join([f"{field_name} {field_type}" for field_name, field_type in fields])
            query = f"CREATE TABLE IF NOT EXISTS {table} ({field_definitions})"
            self.execute_query(query)
            self.logger.info(f"Table '{table}' created successfully.")
            
    def drop_tables(self, tables: List[str]) -> None:
        """
        Drop specified tables.

        Args:
            tables (List[str]): List of table names to drop.
        """
        for table in tables:
            query = f"DROP TABLE IF EXISTS {table}"
            self.execute_query(query)
            self.logger.info(f"Table '{table}' dropped successfully.")

    def commit(self) -> None:
        """Commit the current transaction."""
        if self.connection:
            self.connection.commit()
            self.logger.info("Transaction committed.")

    def close(self) -> None:
        """Close the database connection and engine."""
        try:
            if self.connection and not self.connection.closed:
                self.connection.close()
                self.logger.info("Database connection closed.")
            if self.engine:
                self.engine.dispose()
                self.logger.info("Database engine disposed.")
        except SQLAlchemyError as err:
            self.logger.error(f"Error closing database resources: {err}")

In [4]:
# Example Usage
db_url = "postgresql://geoshop_db_owner:JRdKeBf48tmu@ep-old-boat-a2gt5jte.eu-central-1.aws.neon.tech/geoshop_db?sslmode=require"
db_manager = GestionBD(db_url)

try:
    # Execute a query
    result = db_manager.execute_query_as_df("SELECT * FROM students_student")
    display(result)
finally:
    # Ensure the database is properly closed
    db_manager.close()

INFO:GestionBD:Connected to the database successfully.

   id student_id               name                     branch
0   2        002   Keria AWOUNFOUET  Communication & Marketing
1   1        001  Thomas AWOUNFOUET        Software Developper
2   3        003  Junior AWOUNFOUET            DevOps Engineer
3   4        004  Willie AWOUNFOUET             Chef de Projet

INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.

In [5]:
result = db_manager.execute_query_as_df("SELECT * FROM students_student")
result

INFO:GestionBD:Reconnected to the database.

   id student_id               name                     branch
0   2        002   Keria AWOUNFOUET  Communication & Marketing
1   1        001  Thomas AWOUNFOUET        Software Developper
2   3        003  Junior AWOUNFOUET            DevOps Engineer
3   4        004  Willie AWOUNFOUET             Chef de Projet

In [6]:
db_manager.list_tables()

INFO:GestionBD:Retrieved table list successfully.

['geography_columns',
 'geometry_columns',
 'spatial_ref_sys',
 'django_migrations',
 'django_content_type',
 'auth_permission',
 'auth_group',
 'auth_group_permissions',
 'auth_user_groups',
 'auth_user_user_permissions',
 'django_admin_log',
 'auth_user',
 'django_session',
 'shops_shop',
 'students_student',
 'employees_employee',
 'blog_blog',
 'blog_comment',
 'snippets_snippet']

In [7]:
dbName = "chenil_v4"      # nom de la base de données
user = "postgres"              # propriétaire ou utilisateur
passwd = "admin"            # mot de passe d'accès
host = "127.0.0.1"          # nom ou adresse IP du serveur
port =5432

url_template = "postgresql://<user>:<password>@<host>:<port>/<dbname>"
url = "postgresql://postgres:admin@localhost:5432/discotheque"

In [8]:
db_url = "postgresql://postgres:admin@localhost:5432/chenil_v4"
db_manager = GestionBD(db_url)

db_manager.list_tables()

INFO:GestionBD:Connected to the database successfully.
INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.
INFO:GestionBD:Retrieved table list successfully.

['chiens', 'clients', 'races']

In [9]:
dbName = "chenil_v4"      # nom de la base de données
user = "postgres"         # propriétaire ou utilisateur
passwd = "admin"          # mot de passe d'accès
host = "127.0.0.1"        # nom ou adresse IP du serveur
port = 5432               # port du serveur PostgreSQL

# Construct the URL using the variables
db_url = f"postgresql://{user}:{passwd}@{host}:{port}/{dbName}"

print(db_url)

postgresql://postgres:admin@127.0.0.1:5432/chenil_v4

In [10]:
db_manager = GestionBD(db_url)

db_manager.list_tables()

INFO:GestionBD:Connected to the database successfully.
INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.
INFO:GestionBD:Retrieved table list successfully.

['chiens', 'clients', 'races']

In [11]:
db_manager.execute_query_as_df("SELECT * FROM clients")

,idclient,nomclient,prenomclient,adresseclient,cpclient,villeclient,paysclient,telclient,emailclient
0,1,Moreau,Anne,9 Rue du Cleps,31000,Toulouse,France,0616273216,anne.moreau@orange.fr
1,2,Mitchell,Eddy,97 Rue de Paris,75020,Paris,France,0158444288,e.mitchell@hotmail.fr
2,3,Moreau,William,33 Rue de Crimée,75020,Paris,France,0163243007,william.moreau@free.fr
3,4,Moreau,Lucia,20 Rue de la soif,75010,Paris,France,0142613306,lucia.moreau@orange.fr
4,5,Johnson,Céline,52 Rue du sac à dos,69008,Lyon,France,0618490352,celine.johnson@gmail.com
5,6,Thomas,Nathalie,76 Boulevard des Rousses,69002,Lyon,France,0748072289,jean.martin@gmail.com
6,7,Martin,Nathalie,102 Avenue Phoque,70010,Paris,France,0176091014,emilie.moreau@free.fr
7,8,Gonzalez,Anne,49 Avenue de la joie,06118,Nice,France,0703825524,anne.gonzalez@hotmail.com
8,9,Hernandez,José,26 rue Chivas,58010,Donzy,France,0713522885,j.hernandez@gmail.com
9,10,Hernandez,Samuel,15 rue des Violettes,75020,Paris,France,0167531477,youyou@hotmail.fr
10,11,Rorbert,Sophia,43 Rue Désirée,69025,Lyon,France,0608507445,sophia.robert@gmail.com
11,12,Hernandez,José,26 rue de la Modération,58010,Donzy,France,0614523296,j.hernandez2@gmail.com

In [12]:
db_manager.execute_query_as_df("SELECT * FROM races")

   idrace      nomrace
0       1      Pitbull
1       2   Rottweiler
2       3      Chiwawa
3       4     Labrador
4       5    Dalmatien
5       6        Husky
6       7    Yorkshire
7       8       Poodle
8       9  Fox Terrier
9      10        Boxer

In [13]:
db_manager.execute_query_as_df("SELECT * FROM chiens")

,idchien,nomchien,idrace,sexechien,numtatouagechien,datenaissancechien,couleurpelagechien,idclient,prixvente,datevente
0,1,Wouf,5,True,55260,2021-09-24,Blanc,1.0,980,2023-08-25
1,2,Mentalo,6,False,None,2017-09-15,Blanc,2.0,966,2023-10-25
2,3,Maggie,6,True,99279,2014-03-27,Brun,3.0,883,2022-06-27
3,4,Whisky,2,True,35941,2020-03-11,Doré,4.0,543,2023-02-05
4,5,Bibi,6,True,88123,2020-10-10,Beige,NaN,894,None
5,6,Buddy,4,True,None,2019-02-05,Rouge,5.0,250,2020-01-01
6,7,Sophie,5,False,None,2016-07-01,Doré,5.0,644,2022-03-30
7,8,Molly,2,False,38281,2018-06-16,Gris,NaN,None,None
8,9,Padbol,7,False,None,2014-02-27,Blanc et noir,NaN,685,None
9,10,Buddy,4,True,None,2019-02-05,Rouge,6.0,847,2023-08-14
10,11,Bibi,8,False,61006,2018-06-30,Noir,7.0,692,2022-09-28
11,12,Bibi,8,False,705423,2010-04-15,Blanc,8.0,197,2021-02-22
12,13,Whisky,8,True,None,2019-09-25,Beige,NaN,None,None
13,14,Rocky,3,True,None,2019-06-15,Noir,NaN,None,None
14,15,Whisky,6,True,None,2018-09-02,Gris,9.0,449,2022-07-28
15,16,Duke,2,True,None,2019-06-13,Noir et blanc,10.0,300,2020-01-13
16,17,Buddy,5,True,None,2015-02-13,Brun,11.0,410,2023-09-17
17,18,Lucy,9,False,56352,2019-10-01,Brun,3.0,363,2022-03-14
18,19,Whisky,10,True,None,2017-08-03,Noir,12.0,484,2023-12-01
19,20,Dora,5,False,25536,2023-07-01,Blanc,5.0,1000,2022-03-30
20,21,Shrek,1,True,None,2018-09-02,Vert,12.0,250,2022-07-28

In [14]:
dbName = "chenil_v1"      # nom de la base de données
user = "postgres"         # propriétaire ou utilisateur
passwd = "admin"          # mot de passe d'accès
host = "127.0.0.1"        # nom ou adresse IP du serveur
port = 5432               # port du serveur PostgreSQL

# Construct the URL using the variables
db_url = f"postgresql://{user}:{passwd}@{host}:{port}/{dbName}"

print(db_url)

postgresql://postgres:admin@127.0.0.1:5432/chenil_v1

In [15]:
db_manager = GestionBD(db_url)
db_manager.list_tables()

INFO:GestionBD:Connected to the database successfully.
INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.
INFO:GestionBD:Retrieved table list successfully.

['chiens']

#### 1) Situation 1 : Nathalie veut savoir combien de chiens elle dispose.

In [88]:
# chenil_v1=# SELECT count(*) FROM Chiens;
db_manager.execute_query_as_df("SELECT count(*) FROM Chiens")

   count
0     20

In [89]:
query = "SELECT count(*) FROM Chiens"
db_manager.execute_query_as_df(query)

   count
0     20

Il y a donc 20 chiens.

In [79]:
db_manager.close()

INFO:GestionBD:Database engine disposed.

#### Situation 2 : Un client arrive à l'élevage et demande si Nathalie possède un chien mâle de race Poodle.

```sql
SELECT NomChien, DateNaissanceChien, SexeChien FROM Chiens WHERE RaceChien='Poodle' AND SexeChien='Mâle' AND NomClient IS NULL;`
```

Cette requête : 
- sélectionne toutes les colonnes de tous les chiens (select *)
- dont la race est Poodle (WHERE race='Poodle'),
- le sexe est Mâle (AND SexeChien='Mâle') et
- non vendu ( donc le champ NomClient est NULL

In [16]:
# chenil_v1=# SELECT NomChien, DateNaissanceChien, SexeChien FROM Chiens WHERE RaceChien='Poodle' AND SexeChien='Mâle' AND NomClient IS NULL;
df_chiens = db_manager.execute_query_as_df("SELECT * FROM chiens")
df_chiens.columns

Index(['nomchien', 'racechien', 'sexechien', 'tatouechien', 'numtatouagechien',
       'datenaissancechien', 'couleurpelagechien', 'nomclient', 'prenomclient',
       'adresseclient', 'telclient', 'emailclient', 'prixvente', 'datevente'],
      dtype='object')

In [18]:
(print(df_chiens.shape))
df_chiens.head(2)

(20, 14)

,nomchien,racechien,sexechien,tatouechien,numtatouagechien,datenaissancechien,couleurpelagechien,nomclient,prenomclient,adresseclient,telclient,emailclient,prixvente,datevente
0,Wouf,Dalmatien,male,oui,55260.0,2021-09-24,Blanc,Moreau,Anne,"9 Rue du Cleps, 31000, Toulouse, France",0616273216,anne.moreau@orange.fr,980.00,2023-08-25
1,Mentalo,Husky,Femelle,non,NaN,2017-09-15,Blanc,Mitchell,Eddy,"97 Rue de Paris, 75020, Paris, France",0158444288,e.mitchell@hotmail.fr,966.00,2023-10-25

In [19]:
# SELECT NomChien, DateNaissanceChien, SexeChien FROM Chiens WHERE RaceChien='Poodle' AND SexeChien='Mâle' AND NomClient IS NULL;
query = "SELECT NomChien, DateNaissanceChien, SexeChien FROM Chiens WHERE RaceChien='Poodle' AND SexeChien='Mâle' AND NomClient IS NULL;"
db_manager.execute_query_as_df(query)

Empty DataFrame
Columns: [nomchien, datenaissancechien, sexechien]
Index: []

In [20]:
query = "SELECT NomChien, RaceChien, DateNaissanceChien, SexeChien FROM Chiens;"
db_manager.execute_query_as_df(query)

   nomchien    racechien datenaissancechien sexechien
0      Wouf    Dalmatien         2021-09-24      male
1   Mentalo        Husky         2017-09-15   Femelle
2    Maggie        Husky         2014-03-27      mâle
3    Whisky   Rottweiler         2020-03-11      Maal
4      Bibi        Huski         2020-10-10      mâle
5     Buddy     Labrador         2019-02-05      mâle
6     Rasta    Dalmatien         2016-07-01   femelle
7     Molly   Rottweiler         2018-06-16    femele
8    Padbol    Yorkshire         2014-02-27   femelle
9     Buddy     Labrador         2019-02-05      mâle
10     Bibi       Poodle         2018-06-30   femelle
11     Bibi       Poodle         2010-04-15   femelle
12   Whisky       Poodle         2019-09-25     mâlle
13    Rocky    Chihuahua         2019-06-15      mâle
14   Whisky        Husky         2018-09-02      mâle
15     Duke   Rottweiler         2019-06-13      mâle
16    Buddy    Dalmatien         2015-02-13      mâle
17     Lucy  Fox terrier         2019-10-01   femelle
18   Whisky        Boxer         2017-08-03      mâle
19     Dora    Dalmatien         2023-07-01   femelle

In [100]:
# WHERE racechien='Poodle' AND sexechien='Mâle' AND nomclient IS NULL
query = "SELECT nomchien, racechien, datenaissancechien, sexechien FROM chiens WHERE racechien='Poodle'"
db_manager.execute_query_as_df(query)

  nomchien racechien datenaissancechien sexechien
0     Bibi    Poodle         2018-06-30   femelle
1     Bibi    Poodle         2010-04-15   femelle
2   Whisky    Poodle         2019-09-25     mâlle

In [101]:
query = "SELECT nomchien, datenaissancechien, sexechien FROM chiens WHERE racechien='Poodle' AND sexechien='Mâle'"
db_manager.execute_query_as_df(query)

Empty DataFrame
Columns: [nomchien, datenaissancechien, sexechien]
Index: []

In [102]:
# chenil_v1=# SELECT NomChien, DateNaissanceChien, SexeChien FROM Chiens WHERE RaceChien='Poodle' AND SexeChien LIKE 'm%' AND NomClient IS NULL;
query = "SELECT NomChien, DateNaissanceChien, SexeChien FROM Chiens WHERE RaceChien='Poodle' AND SexeChien LIKE 'm%' AND NomClient IS NULL;"
db_manager.execute_query_as_df(query)

  nomchien datenaissancechien sexechien
0   Whisky         2019-09-25     mâlle

In [23]:
dbName = "chenil_v2"      # nom de la base de données
user = "postgres"         # propriétaire ou utilisateur
passwd = "admin"          # mot de passe d'accès
host = "127.0.0.1"        # nom ou adresse IP du serveur
port = 5432               # port du serveur PostgreSQL

# Construct the URL using the variables
db_url = f"postgresql://{user}:{passwd}@{host}:{port}/{dbName}"

print(db_url)

postgresql://postgres:admin@127.0.0.1:5432/chenil_v2

In [24]:
db_manager = GestionBD(db_url)
db_manager.list_tables()

INFO:GestionBD:Connected to the database successfully.
INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.
INFO:GestionBD:Retrieved table list successfully.

['chiens']

In [25]:
df_chiens = db_manager.execute_query_as_df("SELECT * FROM chiens")
(print(df_chiens.shape))
df_chiens.head()

(20, 14)

,nomchien,racechien,sexechien,tatouechien,numtatouagechien,datenaissancechien,couleurpelagechien,nomclient,prenomclient,adresseclient,telclient,emailclient,prixvente,datevente
0,Wouf,Dalmatien,True,True,55260.0,2021-09-24,Blanc,Moreau,Anne,"9 Rue du Cleps, 31000, Toulouse, France",0616273216,anne.moreau@orange.fr,980.00,2023-08-25
1,Mentalo,Husky,False,False,NaN,2017-09-15,Blanc,Mitchell,Eddy,"97 Rue de Paris, 75020, Paris, France",0158444288,e.mitchell@hotmail.fr,966.00,2023-10-25
2,Maggie,Husky,True,True,99279.0,2014-03-27,Brun,Moreau,William,"33 Rue de Crimée, 75020, Paris, France",0163243007,william.moreau@free.fr,883.00,2022-06-27
3,Whisky,Rottweiler,True,True,35941.0,2020-03-11,Doré,Moreau,Lucía,"20 Rue de la Soif, 75010, Paris, France",0142613306,lucia.moreau@orange.fr,543.00,2023-02-05
4,Bibi,Huski,True,True,88123.0,2020-10-10,Beige,None,None,None,None,None,894.00,None

#### Situation 3 : Nathalie a fait adopter un chien à un client de son chenil. Au bout d’une semaine le client ramène le chien.

#### Situation 5 : Nathalie souhaite envoyer un courrier de remerciement à Celine Jonhson.
Peut-elle connaître son adresse?

Réponse : Oui, Mais …

Nathalie doit parcourir tout son registre afin de trouver l’adresse correspondant au dernier achat. Un travail bien fastidieux.

Au niveau informatique, vous devez effectuer la requête suivante :

In [26]:
# chenil_v2=# SELECT AdresseClient, DateVente FROM Chiens WHERE NomClient='Johnson' AND PrenomClient='Céline' ORDER BY DateVente;

query = "SELECT AdresseClient, DateVente FROM Chiens WHERE NomClient='Johnson' AND PrenomClient='Céline' ORDER BY DateVente;"
db_manager.execute_query_as_df(query)

                                 adresseclient   datevente
0       52 Rue des Pins, 35010, Rennes, France  2020-01-01
1  52 Impasse du Coiffeur, 69008, Lyon, France  2022-03-30
2     52 rue du sac à dos, 69001, Lyon, France  2022-03-30

In [27]:
# chenil_v2=# SELECT AdresseClient, DateVente FROM Chiens WHERE NomClient='Johnson' AND PrenomClient='Céline' ORDER BY DateVente;

query = "SELECT NomClient, PrenomClient, AdresseClient, DateVente FROM Chiens WHERE NomClient='Johnson' AND PrenomClient='Céline' ORDER BY DateVente;"
db_manager.execute_query_as_df(query)

,nomclient,prenomclient,adresseclient,datevente
0,Johnson,Céline,"52 Rue des Pins, 35010, Rennes, France",2020-01-01
1,Johnson,Céline,"52 Impasse du Coiffeur, 69008, Lyon, France",2022-03-30
2,Johnson,Céline,"52 rue du sac à dos, 69001, Lyon, France",2022-03-30

Du coup, quelle est la bonne adresse?
- Il faut rechercher parmi les différentes adresses enregistrées de Céline Johnson la plus récente.
- Elle correspond forcément à l'adresse de la dernière vente, supposée la plus récente.

**Problème** : le plus récent est le _30 Mars 2022_, et il y a deux adresses différentes!

Comment savoir quel est la bonne? Vous dîtes à Nathalie que le seul moyen, est de l'appeler...

Pas très pratique ..

#### Situation 6 : Une loi impose que son élevage ne puisse vendre que les chiens tatoués.

Nathalie cherche alors dans sa colonne "tatouage" s’il est indiqué **0** c’est-à-dire non tatoué suite à votre modification.

Vous tapez la requête suivante permettant de compter les chiens dont le champ "TatouageChien" est égal à 0 :

In [28]:
# chenil_v2=# SELECT COUNT(*) FROM Chiens WHERE TatoueChien = FALSE;

query = "SELECT COUNT(*) FROM Chiens WHERE TatoueChien = FALSE;"
db_manager.execute_query_as_df(query)

   count
0     12

A priori, il y aurait donc **12 chiens non tatoués**.

Votre instinct vous dit de vérifier avec une autre requête.

Dans le doute, vous tapez la requête suivante permettant de compter le nombre de chiens dont le numéro de tatouage est NULL :

In [110]:
# chenil_v2=# SELECT COUNT(*) from Chiens WHERE NumTatouageChien IS NULL ;

query = "SELECT COUNT(*) from Chiens WHERE NumTatouageChien IS NULL ;"
db_manager.execute_query_as_df(query)

   count
0     11

**Bizarre...**
- Il y aurait donc en fait **11 chiens** sans numéros de tatouage.
- Il y donc a **un chien** indiqué non tatoué mais pourtant sans numéro de tatouage.

**Il y a une incohérence visiblement …**

Afin de mettre en évidence cette incohérence, Vous faites la requête suivante :

In [111]:
# chenil_v2=# SELECT NomChien, TatoueChien, NumTatouageChien FROM Chiens;

query = "SELECT NomChien, TatoueChien, NumTatouageChien FROM Chiens;"
db_manager.execute_query_as_df(query)

   nomchien  tatouechien  numtatouagechien
0      Wouf         True           55260.0
1   Mentalo        False               NaN
2    Maggie         True           99279.0
3    Whisky         True           35941.0
4      Bibi         True           88123.0
5     Buddy        False               NaN
6    Sophie        False               NaN
7     Molly         True           38281.0
8    Padbol        False               NaN
9     Buddy        False               NaN
10     Bibi        False           61006.0
11     Bibi         True          705423.0
12   Whisky        False               NaN
13    Rocky        False               NaN
14   Whisky         True               NaN
15     Duke        False               NaN
16    Buddy        False               NaN
17     Lucy        False           56352.0
18   Whisky        False               NaN
19     Dora         True           25536.0

**Question : Quels chiens présentent une incohérence?**

**Lucy** et **Bibi**.
- Si vous regardez de plus près, ces deux chiens n'ont pas de tatouage (valeur à f) et pourtant un numéro existe!
- Il y a un problème de qualité de la donnée.

Pour être précis, vous allez exécuter les requêtes suivantes :

In [112]:
# chenil_v2=# SELECT NomChien, TatoueChien, NumTatouageChien FROM Chiens WHERE TatoueChien = False and NumTatouageChien IS NOT NULL;

query = "SELECT NomChien, TatoueChien, NumTatouageChien FROM Chiens WHERE TatoueChien = False and NumTatouageChien IS NOT NULL;"
db_manager.execute_query_as_df(query)

  nomchien  tatouechien  numtatouagechien
0     Bibi        False             61006
1     Lucy        False             56352

Cette requête vous permet de connaître la liste des chiens indiqués non tatoué (TatoueChien=False) mais qui possèdent malgré cela un numéro de tatouage (NumTatouageChien IS NOT NULL).
- Donc Bibi et Lucy sont indiqués non tatoué et qui pourtant possèdent un numéro de tatouage...

Vous effectuez la requête permettant d’afficher les chiens indiqués comme tatoué mais ne possédant pourtant pas de numéro de tatouage :

In [113]:
# chenil_v2=# SELECT NomChien, TatoueChien, NumTatouageChien FROM Chiens WHERE TatoueChien=True and NumTatouageChien IS NULL;

query = "SELECT NomChien, TatoueChien, NumTatouageChien FROM Chiens WHERE TatoueChien=True and NumTatouageChien IS NULL;"
db_manager.execute_query_as_df(query)

  nomchien  tatouechien numtatouagechien
0   Whisky         True             None

Nathalie avait donc indiqué le chien Whisky comme tatoué alors qu'il ne possède pas de numéro de tatouage.

**Question : comment Nathalie peut régler ce problème
- **Réponse** : Un chien est tatoué s’il a un numéro de tatouage. Si ce n’est pas le cas c’est qu’il n’est tout simplement pas tatoué.
- La colonne "tatouage" est donc inutile et peut même, comme ici, engendrer un risque d’incohérence de donnée.

**A retenir** : `Redondance d’information -> Risque d’incohérence de donnée`

### Situation 7 : Un client souhaite adopter un chien « Noir et Blanc » quelque soit sa race ou autres.

Nathalie vous demande de vérifier s’il y a un chien « Noir et Blanc » disponible.

Vous tapez la requête suivante

In [116]:
# chenil_v2=# SELECT * from Chiens WHERE CouleurPelageChien='Noir et Blanc' AND NomClient IS NULL;

query = "SELECT * from Chiens WHERE CouleurPelageChien='Noir et Blanc' AND NomClient IS NULL;"
db_manager.execute_query_as_df(query)

Empty DataFrame
Columns: [nomchien, racechien, sexechien, tatouechien, numtatouagechien, datenaissancechien, couleurpelagechien, nomclient, prenomclient, adresseclient, telclient, emailclient, prixvente, datevente]
Index: []

Il semble qu'il n'y a pas de chien disponible de couleur "Noir et Blanc".

Vous transmettez l'information à Nathalie. Cette dernière répond donc Non à son client.

Votre instinct vous joue encore des tours. Le doute vous habite et vous décidez d'afficher la liste des chiens avec leur couleur de pelage non vendus

In [131]:
# chenil_v2=# SELECT NomChien, CouleurPelageChien FROM Chiens WHERE NomClient IS NULL;

query = "SELECT NomChien, CouleurPelageChien FROM Chiens WHERE NomClient IS NULL;"
db_manager.execute_query_as_df(query)

  nomchien couleurpelagechien
0     Bibi              Beige
1    Molly               Gris
2   Padbol      Blanc et noir
3   Whisky              Beige
4    Rocky               Noir

**Padbol!**

Oui le chien Padbol a une couleur de pelage Blanc et noir, sûrement pas trop différent de Noir et Blanc.

Sûrement une erreur de saisie de Nathalie, qui passe donc encore une fois à côté d'une vente...

Et Padbol à côté d'une adoption..

### Situation 8 : Nathalie souhaite calculer son chiffre d’affaire en fin d’année. Peut-elle le faire ?

**Réponse** : Oui elle peut le faire, mais...

Oui si nous partons du principe s'il y a retour d’un chien dans la "période d’essai", elle rembourse son client,aboutissant donc à une opération nulle.

En effet, la requête suivante permet de le calculer :

In [134]:
db_manager.close()

db_manager = GestionBD(db_url)

INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.
INFO:GestionBD:Connected to the database successfully.

In [135]:
# chenil_v2=# SELECT SUM("PrixVente") FROM Chiens WHERE DATE_PART('year', DateVente::date)=2022;

# query = "SELECT SUM('PrixVente') FROM Chiens WHERE DATE_PART('year', DateVente::date)=2022;"
query = """
SELECT SUM("PrixVente") 
FROM Chiens 
WHERE DATE_PART('year', DateVente::date) = 2022;
"""

#db_manager.execute_query_as_df(query)

**Explication** : Afficher la somme des prix de vente de la table Chiens dont l’année de la date de vente est 2022. Le résultat est donc 4281 euros

Il y a un petit problème au niveau comptable. En cas de contrôle, toutes les transactions doivent être traçées.

Nathalie est hors la loi dans ce cas précis.

Il y a de nouveau absence de traçabilité.

### Situation 9 : Un client arrive a l'élevage et demande à Nathalie si elle dispose (donc non vendu) un chien de race Rottweiler

Question : Combien chiens de race Rottweiler Nathalie possède-t-elle encore disponible?

In [140]:
db_manager.close()
db_manager = GestionBD(db_url)


# chenil_v2=# SELECT "NomChien", "RaceChien" FROM "Chiens" WHERE "NomClient" IS NULL AND "RaceChien"='Rottweiler';

query = "SELECT NomChien, RaceChien FROM Chiens WHERE NomClient IS NULL AND RaceChien='Rottweiler';"

db_manager.execute_query_as_df(query)

INFO:GestionBD:Database connection closed.
INFO:GestionBD:Database engine disposed.
INFO:GestionBD:Connected to the database successfully.

Empty DataFrame
Columns: [nomchien, racechien]
Index: []

**Aucun Rottweiler semble-t-il**.
- Vous donnez la réponse à Nathalie.
- Vous commencez à en avoir l'habitude. Vous vous êtes fait avoir deux fois, pas une troisième.
- Vous faites rapidement une deuxième vérification avec la requête suivante :

In [141]:
# chenil_v2=# SELECT "NomChien", "RaceChien" FROM "Chiens" WHERE "NomClient" IS NULL AND "RaceChien" LIKE 'Rot%';

query = "SELECT NomChien, RaceChien FROM Chiens WHERE NomClient IS NULL AND RaceChien LIKE 'Rot%' ;"

db_manager.execute_query_as_df(query)

  nomchien   racechien
0    Molly  Rottveiler

Cette requête permet de visualiser les chiens non vendus et dont le nom de la race commence par Rot ( LIKE 'Rot%', le % signifie n’importe quelle chaîne de caractères).

**Et là vous trouvez le chien Molly.**
- En effet, le chien Molly est de race Rottveiler et non Rottweiler. Il n’est donc pas comptabilisé.
- Il s’agit certainement d’une erreur de saisie. Malheureusement Nathalie a été plus rapide que vous et a donné la réponse au client.
- Elle est du coup passée à côté d’une éventuelle vente, une fois de plus...

**Jamais deux sans trois...**
- Vous prenez quelques temps pour réfléchir à une solution.
- La notion de race pour un chenil est très importante, et ne doit donc pas être sujette à l'erreur.

Vous lui proposerez une modification de son système plus tard. Un nouveau client arrive

### Situation 10: Vérifier que José Hernandez ayant acheté le Husky Copper soit le même José Hernandez ayant acheté le Boxer Cooper

**Question**:

Peut-on garantir que José Hernandez ayant acheté le Husky Copper « José Hernandez » ayant acheté le Boxer Cooper est la même personne?


**Réponse** : Non.
- En effet, il existe en France ou ailleurs beaucoup d’homonymes. Il est, par exemple,fréquent pour des familles d’origine hispanique de nommer le fils du même prénom que le père.
- Si cet enfant habite encore chez ses parents, compte tenu des colonnes pouvant « identifier » l’acheteur, on ne peut donc pas le garantir via le système de gestion de Nathalie.
- Nathalie, après investigations, découvre d’ailleurs que ces deux personnes sont belle et bien des personnes différentes. L'un est le fils et l'autre le père.

Vous faites la requête suivante pour vérifier la base de données.

In [143]:
# chenil_v2=# SELECT NomChien, DateVente, PrenomClient, NomClient, AdresseClient, TelClient, EmailClient FROM Chiens WHERE PrenomClient='José' AND NomClient='Hernandez';

query = """
SELECT NomChien, DateVente, PrenomClient, NomClient, AdresseClient, TelClient, EmailClient 
FROM Chiens 
WHERE PrenomClient='José' AND NomClient='Hernandez';
"""

db_manager.execute_query_as_df(query)

,nomchien,datevente,prenomclient,nomclient,adresseclient,telclient,emailclient
0,Whisky,2022-07-28,José,Hernandez,"26 rue Chivas, 58010, Donzy, France",0713522885,j.hernandez@gmail.com
1,Whisky,2022-12-01,José,Hernandez,"26 rue de la Modération, 58010, Donzy, France",0713522885,j.hernandez@gmail.com

Le chien Whisky a en fait été acheté par José Hernandez (père), le chiens Shrek par le fils lorsque celui-ci habitait chez son père.

**Il n'y a ici aucun moyen de les différencier.**
- Puis le fils, un an plus tard, a déménagé dans son propre appartement (26 rue de la Modération) c'est là qu'il a acheté le chien Shrek.
- Il aura fallu une semaine de recherche à Nathalie pour finalement trouver qui était qui!

**Comment remédier à cela ?** 
- `Il faut ajouter une colonne "identifiant" pour les clients.`
- Nous le verrons dans le chapitre suivant, cela se nomme une `"Clé Primaire"`.
- De même, nous pouvons très bien imaginer 2 chiens nés le même jour, de la même race, et du même pelage et sans numéro de tatouage pour le moment.
- Ainsi il serait impossible de les distinguer dans son registre.

**Comment remédier à cela?**
- Il suffit d’ajouter une colonne "identifiant", par exemple un numéro incrémenté de 1 à chaque nouveau chien (1, 2, 3, etc…).
- Vous proposez donc à Nathalie d'ajouter à son tableau un identifiant pour les chiens (IdChien) et un identifiant pour les clients (IdClient).

Cependant vous avez une intuition que ce n'est pas encore la bonne solution afin de résoudre les problèmes mis en en avant par la suite.